Tekla.Structures.Dialog.UIControls.ShapeCatalog
The ShapeCatalog class represents a group of controls to select Shapes
using the Shape catalog.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.shapeSelectionForm
Shape form.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.shapeList
Shape list.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.startShape
Start shape.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.#ctor
Initializes a new instance of the ShapeCatalog class.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.#ctor(System.String)
Initializes a new instance of the ShapeCatalog class and will select
the Shape (if available) in the tree.
shape: The Shape to be selected in the dialog.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.SelectedShape
Gets or sets the selected Shape in the control.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.ShapeSelectionForm
Gets or sets shape form.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.ShapeList
Gets or sets shape list.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.OnLoad(System.EventArgs)
When the load event is raised, the control begins to enumerate through the Shape
catalog.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.OnSelectClicked(System.Object,System.EventArgs)
When the load event is raised, the control begins to enumerate through the Shape
catalog.
sender: The sender.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.Dialog.UIControls.ShapeCatalog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ShapeCatalog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.